TAL_INT_GIT/Sample Data/BY_WMS/Inventory_Adjestment/input/INV_ADJ_mul_2/INV_ADJ_mul_2

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:sap-com:document:sap:soap:functions:mc-style">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:ZwmInventoryAdjustment>
         <ItInvAdj>
            <!--Zero or more repetitions:-->
            <item>
					<Werks>C2C1</Werks>
					<Lgort>1000</Lgort>
					<Matnr>4017530500001</Matnr>
					<Charg>100400</Charg>
					<Menge>22</Menge>
					<Meins/>
					<Bktxt/>
					<Bldat>2021-05-01</Bldat>
					<Zldat>2021-05-01</Zldat>
					<Budat>2021-05-01</Budat>
				</item>
				<item>
					<Werks>C2C1</Werks>
					<Lgort>1000</Lgort>
					<Matnr>4017530500001</Matnr>
					<Charg>100400</Charg>
					<Menge>22</Menge>
					<Meins/>
					<Bktxt/>
					<Bldat>2021-05-01</Bldat>
					<Zldat>2021-05-01</Zldat>
					<Budat>2021-05-01</Budat>
				</item>
         </ItInvAdj>
         <Return>
            <!--Zero or more repetitions:-->
            <item>
               <Type></Type>
               <Id></Id>
               <Number></Number>
               <Message></Message>
               <LogNo></LogNo>
               <LogMsgNo></LogMsgNo>
               <MessageV1></MessageV1>
               <MessageV2></MessageV2>
               <MessageV3></MessageV3>
               <MessageV4></MessageV4>
               <Parameter></Parameter>
               <Row></Row>
               <Field></Field>
               <System></System>
            </item>
			<item>
               <Type></Type>
               <Id></Id>
               <Number></Number>
               <Message></Message>
               <LogNo></LogNo>
               <LogMsgNo></LogMsgNo>
               <MessageV1></MessageV1>
               <MessageV2></MessageV2>
               <MessageV3></MessageV3>
               <MessageV4></MessageV4>
               <Parameter></Parameter>
               <Row></Row>
               <Field></Field>
               <System></System>
            </item>
         </Return>
      </urn:ZwmInventoryAdjustment>
   </soapenv:Body>
</soapenv:Envelope>